```data.github_repositories.organization_repos: Reading...
data.github_repositories.organization_repos: Read complete after 1s [id=org:hutchic-observe-meta]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.organization_members["colinh-kong"] will be created
  + resource "github_membership" "organization_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "colinh-kong"
    }

  # github_membership.organization_members["hutchic"] will be created
  + resource "github_membership" "organization_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "hutchic"
    }

  # github_repository.enable_security_alerts["template-template"] will be created
  + resource "github_repository" "enable_security_alerts" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "template-template"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository.enable_security_alerts["template-terraform"] will be created
  + resource "github_repository" "enable_security_alerts" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "template-terraform"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository.enable_security_alerts["tf-github"] will be created
  + resource "github_repository" "enable_security_alerts" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tf-github"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_team.parent_teams["observe-employees"] will be created
  + resource "github_team" "parent_teams" {
      + create_default_maintainer = false
      + description               = "observe-employees team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "observe-employees"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["frontend"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Frontend subteam"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "frontend"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["integrations"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Integrations subteam"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "integrations"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.parent_team_members["colinh-kong:observe-employees"] will be created
  + resource "github_team_membership" "parent_team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.parent_team_members["hutchic:observe-employees"] will be created
  + resource "github_team_membership" "parent_team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hutchic"
    }

  # github_team_membership.team_members["colinh-kong:frontend"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.team_members["colinh-kong:integrations"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.team_members["hutchic:integrations"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hutchic"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```